'use strict';

const messages = {
    H1: 'Заголовок',
    H2: 'Категория',
    H3: 'Название услуги',
    P: 'Цена',
    SPAN: 'Описание услуги',
    FOOTER: 'Дополнительный текст',
    PRICE: 'ПРАЙС',
    ITEMS: [
        { type: 'CATEGORY', H2: 'Макияж' },
        {
            type: 'SERVICE',
            H3: 'Архитектура бровей',
            P: '1400',
            SPAN: 'моделирование + окрашивание + коррекция',
        },
        {
            type: 'SERVICE',
            H3: 'Архитектура + долговременная укладка',
            P: '2000',
        },
        {
            type: 'SERVICE',
            H3: 'Коррекция + долговременная укладка',
            P: '1800',
        },
    ],
    EXAMPLE_FOOTER: 'При одновременной записи на процедуры из разных категорий — скидка 100 рублей',
    FILE_LOAD_ERROR: "Не удалось загрузить файл",
    REMOVE_ELEMENT: 'Удалить элемент',
    REMOVE_PAGE: 'Удалить страницу?',
    IMPORT_CONFIRM: 'Это сотрёт текущий прайс. Продолжить?',
    LOAD_CONFIRM: 'Загрузить последний прайс, над которым вы работали? Он будет без картинок.',
    PAGES: '{"PAGES":[{"H1":"ПРАЙС","STYLE":{"backgroundColor":"rgb(0, 0, 0)","color":"rgb(230, 228, 200)","justifyContent":"flex-end","opacity":"0"}},{"ITEMS":[{"type":"CATEGORY","H2":"Макияж"},{"type":"SERVICE","H3":"Архитектура бровей","P":"1400","SPAN":"моделирование + окрашивание + коррекция"},{"type":"SERVICE","H3":"Архитектура + долговременная укладка","P":"2000"},{"type":"SERVICE","H3":"Коррекция + долговременная укладка","P":"1800"}],"FOOTER":"При одновременной записи на процедуры из разных категорий — скидка 100 рублей","STYLE":{"backgroundColor":"rgb(50, 50, 50)","color":"rgb(255, 255, 255)","opacity":"0.5"}}],"STYLE":{"aspectRatio":"4 / 5"}}',
};